{
    "greeting": "Bonjour",
    "hire-me": "Engagez-moi",
    "download-resume": "Télécharger le CV",
    "nav-home": "Accueil",
    "nav-work": "Projets",
    "nav-hobbies": "Activités",
    "nav-education": "Formation",
    "nav-resume": "CV",
    "min-read-text": "min de lecture",
    "back-education": "Retour à la page Formation",

    "see-article-text": "Consulter l'article",
    "toolbox-text": "Boîte à outils",

    "tag-bike": "velo",
    "tag-photography": "photographie",
    "tag-diy": "diy",
    "tag-weld": "soudo-brasure",

    "hobbies-intro": "Dans cette section, je partage mes passions et mes activités, allant de la photographie à la fabrication additive, en passant par la mécanique générale et la restauration de meubles anciens. Chaque domaine est pour moi une source d'inspiration et de découverte, où je m'efforce de développer mes compétences et d'explorer de nouvelles possibilités.",
    "work-intro": "Dans cette section, je partage mes projets professionnels, allant de l'ingénierie mécanique à la conception d'une solution SaaS. Ces projets m'ont permis de développer ma boîte à outils métier. D'une part, j'ai pu mettre en pratique mes compétences en ingénierie mécanique, en conception et innovation de produit. D'autre part, en tant que moteur d'un projet, j'ai pu m'exercer à la définition d'une application web répondant à un besoin utilisateur spécifique.",
    
    "a1-title": "Fabrication d'un velo sur mesure",
    "a1-tile-intro": "Explorez ce projet où j'ai conçu et fabriqué un cadre de vélo sur mesure alliant performance et polyvalence. De la conception à l'assemblage final par soudo-brasure, chaque étape a été orchestrée avec des décisions techniques précises, démontrant ainsi mes compétences en ingénierie mécanique.",
    "a1-intro": "Pendant ce projet, l'objectif était de créer un cadre de vélo sur mesure mettant l'accent sur la polyvalence. J'ai cherché à concevoir un vélo capable de combiner agilité et vitesse pour les saisons estivales, tout en restant stable et adapté aux conditions hivernales. De la conception et la modélisation de la géométrie jusqu’à la fabrication du cadre, j'ai pris en charge l'intégralité du processus. Les décisions techniques, telles que le choix des matériaux, des tubes, et des standards pour les interfaces, la transmission, le freinage, ont été prises avec rigueur. Les étapes pratiques de la fabrication, allant du grugeage des tubes aux derniers ajustements, au pointage, et enfin, à l'assemblage par brasage au bronze et à l'argent, ont été exécutées avec précision.",
    "a1-h1": "Conception",
    "a1-h1-s1": "Inspiration, mesures et géométrie",
    "a1-h1-s1-t1": "Dans la conception de ce vélo, j'ai cherché à fusionner les caractéristiques géométriques d'un vélo de route avec celles d'un vélo de gravel. Inspiré par les réalisations artisanales de l'entreprise Cyfac, renommée pour son expertise dans la conception de vélos haute performance, j'ai déterminé les angles en m'appuyant sur les données techniques précises de leurs modèles. La prise de décision a été éclairée par la consultation de manuels dédiés aux cadreurs, afin d'évaluer l'impact prévu de ces choix d'angles sur le comportement du vélo. Optant pour un tube horizontal légèrement incliné et une implantation basse des haubans pour accroître la réactivité, j'ai également envisagé l'utilisation de pattes arrières coulissantes. Cette ajout autorise une légère modification de la géométrie qui permettra d’adapter différentes tailles de roues en fonction de l'usage, tout en minimisant les altérations sur le comportement du vélo. Enfin, la modélisation géométrique a été réalisée à l'aide du logiciel BikeCAD, garantissant une approche méthodique.",
    "a1-h1-s2": "Choix techniques et assemblage",
    "a1-h1-s2-t1": "Les avancées récentes dans la fabrication de tubes d'acier haut de gamme offrent des caractéristiques mécaniques idéales pour une utilisation en longue distance, comprenant une excellente résistance, un poids optimal, une absorption efficace des vibrations, ainsi qu’une facilité à être travaillé ce qui permet une bonne réparabilité. Dans cette optique, j'ai opté pour une sélection méticuleuse de tubes en acier de la marque Columbus, en ajustant soigneusement les épaisseurs, les formes de sections, et les nuances d'acier pour obtenir le comportement dynamique souhaité. La définition des standards a suivi, englobant le choix du type de transmission, de l'axe des roues, des interfaces pour le boîtier de pédalier, du jeu de direction, du système de freinage, du routage de la câblerie mécanique, ainsi que celui de l'électrique pour l'utilisation d'un moyeu dynamo. D'autres aspects ont également été pris en compte, tels que les emplacements des supports filetés pour le montage d'accessoires, la présence d'une ouverture sur le triangle arrière pour l'utilisation d'une courroie de transmission, et la section de pneus maximale autorisée.",
    "a1-h2": "Réalisation",
    "a1-h2-t1": "La réalisation de ce vélo a été entreprise au cours d'un stage de cadreur chez LaFraise à Roubaix, afin de bénéficier de l'expertise d'Andréa, un artisan renommé pour la qualité de ses réalisations, et des équipements spécialisés à disposition tels que le marbre, le poste à souder, les consommables, les limes, les outils de mesure d'angle, les filières, etc. En raison de la forte demande pour ce stage, j'ai réservé ma place longtemps à l'avance, ce qui a entraîné une attente d'un peu plus d'un an avant de pouvoir débuter. Cette période d'attente m'a offert l'opportunité d'approfondir mes connaissances théoriques sur le procédé d'assemblage par soudo-brasure au bronze et à l'argent. Une fois le stage entamé, j'ai exposé en détail mon projet à Andréa, nous avons vérifié les mesures et apporté quelques modifications à la géométrie. Par la suite, Andréa m'a enseigné les techniques nécessaires pour la soudo-brasure, couvrant le réglage de la flamme, les températures appropriées, les mouvements requis, etc. Après avoir découpé, grugé, limé et ajusté les différents tubes, je me suis ensuite occupé du pointage et du soudage de l'assemblage, ainsi que de tous les autres accessoires.",
    "a1-h3": "Conclusion",
    "a1-h3-t1": "En conclusion, ce projet de conception et fabrication d'un cadre de vélo sur mesure a été une expérience enrichissante. De la sélection minutieuse des matériaux à l'apprentissage des techniques avancées de soudo-brasure, chaque étape m'a permis d'approfondir ma compréhension du processus de fabrication des cadres de vélo. Le stage chez LaFraise, sous la guidance d'Andréa, a concrétisé mes compétences en ingénierie mécanique dans un contexte concret. Cette expérience a renforcé mes connaissances techniques et souligné l'importance de l'expertise artisanale. Fort de ces acquis, je m'apprête à aborder la prochaine phase passionnante de ce projet : la mise en peinture du cadre. Cette étape ajoutera une touche esthétique finale et scellera le caractère unique de ce vélo sur mesure. En envisageant l'avenir, je prévois de m'équiper davantage pour me lancer dans la réalisation d'un vélo cargo. Ce projet futur sera l'occasion de mettre en pratique mes compétences, tout en explorant de nouvelles possibilités dans le monde de l'ingénierie mécanique appliquée au cyclisme.",

    "a2-title": "Collection de vélos",
    "a2-tile-intro": "Plongez dans une collection de vélos qui conjugue ingénierie, art et histoire, révélant l'évolution technologique de l'ingénierie mécanique dans le domaine du cyclisme. Chaque pièce reflète un artisanat méticuleux, une expression artistique et des exploits sportifs, offrant une immersion captivante dans l'univers du cyclisme.",
    "a2-intro": "Bien plus qu'un simple assemblage de pièces mécaniques, ma collection de vélos incarne un témoignage vivant des avancées technologiques, d'un artisanat élevé au rang de l'art, et des exploits sportifs historiques. Chaque vélo, méticuleusement sélectionné, devient une pièce unique racontant une histoire singulière dans le monde du cyclisme. Découvrez au travers de cette exploration une métamorphose où un cadre de vélo devient une toile pour l'innovation, les maîtres cadreurs des artistes, et chaque vélo un témoin privilégié de l'histoire du cyclisme.",
    "a2-h1": "Une collection comme vitrine technologique",
    "a2-h1-t1": "Le cadre d'un vélo constitue une plateforme pour des avancées technologiques marquantes, intégrant une diversité de matériaux et de techniques d'assemblage. Les matériaux, tels que l'acier, l'aluminium, le magnésium, le titane, et les composites (carbone, kevlar, bois), sont associés à divers procédés d'assemblage tels que la soudure, l'emmanchage, le moulage, et plus récemment la fabrication additive métallique. Des innovations historiques, comme le 'butting' des tubes en acier permettant d'ajuster les épaisseurs de section dans un seul tube en fonction des contraintes, illustrent ces avancées techniques. L'évolution des géométries, soutenue par des principes de biomécanique et des essais en soufflerie pour évaluer les impacts aérodynamiques, joue également un rôle crucial dans ces progrès.",
    "a2-h1-t2": "Les autres composants, depuis la transmission à pignon fixe jusqu'aux systèmes de vitesses par dérailleurs mécaniques et aux versions électroniques sans fil actuelles, ainsi que des jantes en bois aux jantes aérodynamiques en carbone avec pneus tubeless, ont également connu des transformations significatives au fil du temps.",
    "a2-h1-t3": "Chaque vélo de ma collection devient ainsi une vitrine illustrant les avancées technologiques propres à son époque. En examinant attentivement ces évolutions, je m'immerge dans l'histoire du design des vélos, établissant des liens entre les choix technologiques et les performances sur la route. Cette perspective unique me permet d'apprécier pleinement la richesse de chaque pièce de ma collection en tant que témoin des progrès techniques dans le domaine du cyclisme et de l'ingénierie en général.",
    "a2-h2": "Une collection qui élève l'artisanat au rang d'art",
    "a2-h2-t1": "La deuxième dimension de ma collection s'articule autour de leur interprétation en tant qu'œuvres d'art, conférant à l'artisanat un statut artistique. Cette perspective met en évidence des réalisations d'une grande précision, où des maîtres cadreurs tels que Masi, Colnago et Cinelli en Italie, Routens et Sablière en France, ainsi que Samson au Japon, ont modelé des pièces uniques, voire emblématiques. Ces artisans ont conçu des vélos à la pointe de la technologie de leur époque, évoluant par la suite en véritables expressions artistiques.",
    "a2-h2-t2": "De manière similaire, certains composants issus de marques renommées telles que Campagnolo, parfois même personnalisés par des gravures, ainsi que d'autres vestiges des interprétations de l'aérodynamisme à cette époque, contribuent à élever ces vélos au rang d'œuvres intrigantes. Qu'ils revêtent une fonctionnalité ou une esthétique particulière, ces éléments confèrent à chaque vélo de ma collection une aura artistique, attestant de la convergence entre un artisanat d'une grande précision et une expression visuelle forte.",
    "a2-h2-t3": "Enfin, les peintures qui habillent ces vélos jouent également un rôle essentiel dans cette vision artistique au sens premier du terme. Des peintres tels que Mario Martini chez Somec ont révolutionné cette dimension en introduisant des techniques et des expressions graphiques novatrices. Les détails graphiques méticuleux et les choix de couleurs deviennent autant d'éléments transformant chaque vélo en une œuvre visuelle captivante.",
    "a2-h3": "Une collection témoignant d'exploits sportifs historiques",
    "a2-h3-t1": "La troisième dimension de ma collection réside dans son intérêt historique, agissant comme gardienne d'un patrimoine qui incarne l'apogée de l'artisanat tout en témoignant des exploits sportifs marquants.",
    "a2-h3-t2": "Elle comprend plusieurs vélos ayant pris part au Tour de France, chacun porteur de l'histoire d'une époque. Parmi eux, le vélo sur lequel Marc Sergeant a triomphé lors de la 5ème étape du Tour de France 1987 au sein de l'équipe Lotto-Eddy Merckx, celui sur lequel Alain Bondue a remporté la médaille d'argent aux J.O. de Moscou en 1980, ou bien même une réplique exacte du contre-la-montre que Laurent Fignon roulait lorsqu'il a manqué de peu sa troisième victoire au Tour de France 1989, concédant la première place à Greg Lemond par un écart de seulement 8 secondes.",
    "a2-h4": "Conclusion",
    "a2-h4-t1": "En rassemblant ces différentes dimensions, ma passion pour la collection de vélos se dessine comme une exploration technique et historique. Chaque élément qui la constitue est une pièce d'ingénierie témoignant des avancées techniques, des compétences artisanales et des faits marquants de l'histoire du cyclisme. Au-delà de l'assemblage de composants, chaque vélo représente une étape dans l'évolution du design et une réflexion sur l'ingénierie mécanique appliquée à ce domaine. Ainsi, cette collection devient une documentation vivante de l'évolution de cette discipline, allant des matériaux au design, en passant par les innovations techniques, tout en préservant l'héritage sportif qui lui est associé.",
    
    "a3-title": "Photographie",
    "a3-tile-intro": "Explorez ma passion pour la photographie en tant que forme d'expression artistique subtile et technique, découvrant son évolution à travers la rétro-ingénierie des dispositifs argentiques et la collection d'appareils emblématiques.",
    "a3-intro": "La photographie, bien plus qu'une simple capture d'images, est pour moi une démarche artistique subtile où l'on compose avec le réel comme moyen d'expression dans sa forme la plus pure. J'ai exploré cette passion à travers différentes techniques, de la photographie numérique à l'argentique, tout en étudiant l'histoire et l'évolution des dispositifs photographiques.",
    "a3-h1": "Mon expérience de photographie",
    "a3-h1-t1": "Issue d'une lignée où la photographie était omniprésente, avec mon grand-père, mon frère et mon père pratiquant tous la photographie, tandis que ma mère, elle, était devant l'objectif durant sa carrière de mannequin, j'ai développé une profonde appréciation pour cet art. Bien que les capteurs numériques et les smartphones offrent désormais des outils photographiques accessibles à tous, j'ai débuté ma pratique avec ces dispositifs avant de progresser vers une compréhension plus profonde des techniques d'exposition et de l'art du photographe en me plongeant dans les grands ouvrages du domaine. Après une période dans la photographie numérique, j'ai choisi de me tourner vers la pratique argentique, plus exigeante mais aussi plus gratifiante, m'offrant une expérience photographique plus intense et me permettant de progresser rapidement.",
    "a3-h2": "Une collection entre rétro-ingénierie et Histoire",
    "a3-h2-t1": "Je suis fasciné par l'évolution des dispositifs photographiques, depuis le premier appareil photo plein format inventé par Oskar Barnack en 1913 jusqu'aux appareils Hasselblad 500EL utilisés lors des missions lunaires Apollo, en passant par le télescope spatial Hubble qui capture l'univers en haute résolution. Ces avancées technologiques m'ont conduit à constituer une collection d'appareils argentiques, où je m'intéresse particulièrement à la rétro-ingénierie pour en comprendre leur fonctionnement. À travers des modèles tels que le Contax II utilisé par Gordon Parks pour documenter la ségrégation raciale dans les années 1950 et le Nikon F de Sean Flynn couvrant la guerre du Vietnam dans les années 1970, je perçois l'importance de ces outils dans l'immortalisation d'événements historiques. En analysant ces mécanismes, je cherche à comprendre comment les ingénieurs du passé ont conçu ces assemblages mécaniques remarquables, ce qui enrichit ma compréhension de l'évolution de la technologie photographique. Cette exploration me permet également de comparer ces anciens dispositifs aux nouveaux appareils numériques ultra performants que j'utilise dans mes travaux professionnels, offrant ainsi un aperçu des avancées techniques et des défis rencontrés à différentes époques.",
    "a3-h3": "Conclusion",
    "a3-h3-t1": "Fort de ma tradition familiale dans la photographie, j'ai développé une profonde appréciation pour cet art, le considérant comme bien plus qu'une simple capture d'images, mais comme une forme d'expression subtile et pertinente. Mon parcours m'a conduit à explorer à travers la rétro-ingénierie ces dispositifs photographiques argentiques, une démarche enrichissante qui m'a permis de comprendre leur fonctionnement et leur évolution au fil du temps. En collectionnant des modèles emblématiques, j'ai pleinement pris conscience de leur importance dans la documentation d'événements historiques, tout en acquérant une meilleure compréhension technique des mécanismes qui les composent. Animé par cette passion, je souhaite désormais approfondir ma pratique en me tournant vers le tirage argentique et partager mes découvertes à travers l'organisation d'une exposition, offrant ainsi un regard unique sur mon interprétation de cet art.",

    "a4-title": "Culture Maker",
    "a4-tile-intro": "Adapté à la fabrication additive et aux réparations électroniques, je maîtrise une variété de domaines allant du logiciel à la mécanique générale. Mon engagement dans la culture Maker et le DIY reflète une philosophie de vie où la compréhension et la maîtrise des systèmes sont primordiales.",
    "a4-intro": "La culture Maker et DIY fait partie intégrante de mon profil, héritée d'une lignée familiale où l'ingéniosité et la curiosité intellectuelle sont des valeurs primordiales. Cette tradition d'innovation remonte à plusieurs générations, avec mon arrière-grand-père qui dessinait déjà des plans d'éoliennes à la main, tandis que mon grand-père était entrepreneur dans l'aéronautique et mon père travaillait pour le programme spatial Arianne. Ce contexte m'a inculqué une volonté de comprendre les mécanismes qui m'entourent à travers une approche systématique, fondamentale dans ma quête d'exploration et d'innovation.",
    "a4-h1": "Culture Maker et DIY",
    "a4-h1-t1": "Dans le domaine de la fabrication additive, j'ai acquis une expertise en améliorant progressivement ma première machine par diverses mises à niveau, telles que la modification de son micro-logiciel ou l'installation de capteurs pour le nivellement automatique du plateau d’impression. J'ai exploré les paramètres d'impression dans les logiciels de découpe et utilisé une variété de matériaux pour répondre à diverses applications, de la fabrication de pièces en plastique (PLA, PETG, ABS) aux impressions métalliques en frittage de poudre (acier inoxydable, cuivre).",
    "a4-h1-t2": "Parallèlement, je me suis investi dans la fabrication, la réparation et la modification dans des domaines tels que l'électronique, la mécanique et l'audio. De la fabrication de claviers ergonomiques (projet open source Ergodox) à la réparation d'appareils électroniques, j'ai développé une expertise diversifiée. J'ai également exploré les domaines de la restauration de montres et de la fabrication d’enceintes.",
    "a4-h1-t3": "Quelques opérations que j'ai réalisées incluent le diagnostic et le remplacement des composants défaillants tels que des écrans, des batteries, des nappes et des fiches ; la réalisation de soudures de composants SMD sur des cartes mères ; l'assemblage complet d’ordinateurs, comprenant la configuration en dual boot, l’overclocking du CPU, et l'application de pâte thermique ; ainsi que l'exécution de déblocages root de téléphones, etc.",
    "a4-h1-t4": "En dehors de ces domaines, je pratique également la mécanique générale en entretenant et réparant mes véhicules motorisés, je m'adonne à la restauration de meubles anciens et j'assure tout l'entretien de ma maison, qu’il s’agisse de peinture ou de creuser une tranchée pour y installer la fibre. Pour moi, cette approche va bien au-delà du simple passe-temps ; c'est une véritable philosophie de vie, où la compréhension et la maîtrise des systèmes qui m'entourent sont au cœur de mes activités quotidiennes.",
    "a4-h2": "Conclusion",
    "a4-h2-t1": "Enracinée dans une tradition familiale d'ingéniosité et de curiosité, ma passion pour le DIY est le fruit d'une lignée où la volonté de comprendre les mécanismes du monde est une valeur primordiale. De l'amélioration de mes imprimantes 3D à la réparation d'appareils électroniques en passant par la fabrication de claviers ergonomiques et la mécanique générale, chaque projet représente une exploration minutieuse des systèmes qui nous entourent. Cette approche ne se limite pas à un simple loisir, mais incarne une philosophie de vie où la connaissance et la maîtrise des technologies façonnent mon quotidien.",

    "a5-title": "Sport et autres activités",
    "a5-tile-intro": "",
    "a5-intro": "Dans cette exploration de ma vie et de mes passions, je navigue entre les sentiers escarpés des montagnes alpines et les dédales intellectuels des sciences sociales. Je m'appuie sur une diversité d'activités, allant du cyclisme à la réflexion philosophique, pour nourrir mon esprit et mon corps, cherchant constamment l'harmonie entre les différents aspects de mon existence.",
    "a5-h1": "Pratiques Sportives : Un Souffle d'Air Frais",
    "a5-h1-t1": "Cyclisme Multifacette : Le cyclisme est au cœur de ma vie active, m'offrant des défis et des expériences variées. Des routes sinueuses du cyclisme sur route aux chemins gravel, en passant par les sentiers plus sauvages du VTT cross-country, chaque sortie représente une aventure unique où je me confronte à mes limites et je me connecte avec la nature.",
    "a5-h1-t2": "Passion pour le Ski : Né dans la région d'Annecy, j'ai développé une affection particulière pour le ski dès mon plus jeune âge. Des descentes effrénées sur les pistes enneigées aux montagnes majestueuses des Alpes, le ski est une passion qui transcende le simple plaisir de glisser sur la neige. En plus de ma pratique, je maîtrise les subtilités de l'entretien des skis, assurant ainsi des performances optimales sur les pentes enneigées.",
    "a5-h1-t3": "Randonnées Envoûtantes : Parcourir les sentiers de randonnée, surtout ceux qui s'étendent sur plusieurs jours et mènent à des refuges isolés, est une expérience envoûtante. Dans ces moments, je me laisse envelopper par la beauté brute de la nature, trouvant une sérénité profonde dans la simplicité de la vie en plein air.",
    "a5-h2": "Sciences Sociales et Société : La Quête de Compréhension",
    "a5-h2-t1": "Exploration Intellectuelle : En dehors de mes activités sportives, je consacre une part significative de mon temps à explorer divers sujets dans les domaines des sciences sociales. De l'anthropologie à la rhétorique, en passant par la psychologie sociale et la sociologie, chaque discipline me permet de décoder les mécanismes complexes qui sous-tendent notre société.",
    "a5-h2-t2": "Réflexions Sociétales : Les enjeux de société m'intéressent particulièrement, notamment l'éthique de l'innovation, les dynamiques de pouvoir, ou encore l'évolution des médias. Je m'interroge sur les implications sociales et éthiques des avancées technologiques, telles que l'intelligence artificielle, les smartphones et les réseaux sociaux, sur nos vies et nos sociétés.",
    "a5-h3": "Équilibre et Bien-Être : connexion entre Nature et Esprit",
    "a5-h3-t1": "Passion pour la Nature : Fasciné par les équilibres naturels et la biodiversité, je cultive une passion profonde pour les plantes et les merveilles de la faune et de la flore. Chaque plante, chaque animal, représente un écosystème à part entière, témoignant de la complexité et de la beauté du monde naturel. Quête de Vérité et Philosophie de Vie : Enfin, ma quête de vérité s'étend au-delà des connaissances académiques, englobant également les réflexions philosophiques. Je cherche à établir des ponts entre les connaissances sociales, littéraires et scientifiques, explorant les liens entre la physique, la mécanique et les questionnements existentiels.",
    "a5-h4": "Conclusion",
    "a5-h4-t1": "Dans cette exploration de ma vie et de mes passions, je trouve un équilibre entre le mouvement et la contemplation, entre l'action physique et la réflexion intellectuelle. À travers le sport, les sciences sociales et la connexion avec la nature, je façonne une existence riche et épanouissante, cherchant toujours à élargir mes horizons et à approfondir ma compréhension du monde qui m’entoure.",

    "resume-summary-text": "XXXXXXXXXXXX",
    "resume-about-me-text": "À propos",
    "resume-education-title": "Formations",
    "resume-hobbies-title": "Centres d'intérêts",
    "resume-skills-title": "Compétences",

    "hobbies-t1": "Fabrication artisanale de vélos",
    "hobbies-t2": "Collection de vélos anciens",
    "hobbies-t3": "Photographie numérique, argentique",
    "hobbies-t4": "Design industriel, culture Maker",
    "hobbies-t5": "Low, High Tech, I.A.",
    "hobbies-t6": "Psychologie sociale, sociologie",
    "hobbies-t7": "Antropologie, sociétés",
    "hobbies-t8": "Cyclisme, randonnée, ski"
}